[
  {
    "_id": "graph_theory_q1",
    "topic": "graph_theory",
    "question_number": 1,
    "difficulty": "medium",
    "type": "multiple_choice",
    "question_text": "Which of the following options represents the graph G = (V, E) where V={1, 2, 3, 4} E={(1, 2), (1, 3), (1, 4), (2, 3), (3, 4)}?",
    "image_file": "1.png",
    "options": ["Option A", "Option B", "Option C", "Option D"],
    "correct_answer": "Option D",
    "explanation": "Option D correctly shows all 5 edges: (1,2), (1,3), (1,4), (2,3), and (3,4). The graph has vertex 1 connected to all others, and additional edges between (2,3) and (3,4).",
    "points": 1
  },
  {
    "_id": "graph_theory_q2",
    "topic": "graph_theory",
    "question_number": 2,
    "difficulty": "medium",
    "type": "multiple_choice",
    "question_text": "The person 'A' is a job applicant while another person 'B' is a hiring manager at a company. Although both of them are members of the website 'Linked-In', 'A' is not directly connected to 'B' via the website. The 1 point networks of 'A' and 'B' are shown in the graph below. Choose the option which shows one of the shortest paths of connecting 'A' and 'B'.",
    "image_file": "2.png",
    "options": ["ACEHJB", "ADFKB", "ADGB", "AKB"],
    "correct_answer": "AKB",
    "explanation": "AKB represents the shortest path between A and B. Looking at the network graph, the path A → K → B has only 2 edges, making it shorter than ACEHJB (5 edges), ADFKB (4 edges), and ADGB (3 edges).",
    "points": 1
  },

  {
  "_id": "graph_theory_q3",
  "topic": "graph_theory",
  "question_number": 3,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "An electrical wire having a resistor can be represented as an edge of a graph i.e., a resistor is equivalent to two nodes connected with one edge (shown in figure AQ-10.1) and if there is no resistor, it will be counted as only one node. Based on the figure AQ-10.1, find which graph represents the network shown in figure AQ-10.2.",
  "image_file": "3.png",
  "options": [
    "Graph with 4 nodes in diamond shape, fully connected with all diagonals",
    "Graph with 4 nodes in diamond shape, connected without one diagonal",
    "Graph with 4 nodes in diamond shape, three sides with one diagonal",
    "Graph with 4 nodes in triangular configuration with curved edges"
  ],
  "correct_answer": "Graph with 4 nodes in diamond shape, fully connected with all diagonals",
  "explanation": "The circuit in figure AQ-10.2 shows a bridge configuration with resistors. Converting each resistor to an edge: there are resistors connecting all four corner nodes, plus the bridge resistor in the middle creates the diagonal connections. This results in a complete graph with 4 nodes where all possible edges exist, matching the first option.",
  "points": 1
},

{
    "_id": "graph_theory_q4",
    "topic": "graph_theory",
    "question_number": 4,
    "difficulty": "easy",
    "type": "multiple_choice",
    "question_text": "Find the adjacency matrix for the following graph. (Take the sequence as A, B, C, and D).",
    "image_file": "4.png",
    "options": [
      "[[0,1,0,0], [0,1,1,0], [0,0,1,1], [0,0,0,0]]",
      "[[0,1,0,0], [0,0,0,0], [0,1,0,1], [1,1,0,0]]",
      "[[0,0,0,0], [0,1,1,0], [0,0,1,1], [0,1,0,1]]",
      "[[1,1,1,1], [0,1,1,0], [0,0,0,0], [0,1,0,1]]"
    ],
    "correct_answer": "[[0,0,0,0], [0,1,1,0], [0,0,1,1], [0,1,0,1]]",
    "explanation": "In a directed graph adjacency matrix, entry A[i][j] = 1 when there is a directed edge from vertex i to vertex j. Following the graph with vertex order A, B, C, D: A→B and A→D (row 0: [0,1,0,1]), B→C and B→D (row 1: [0,0,1,1]), C→D (row 2: [0,0,0,1]), D has no outgoing edges (row 3: [0,0,0,0]). This matches option 3.",
    "points": 1
  },
  {
    "_id": "graph_theory_q5",
    "topic": "graph_theory",
    "question_number": 5,
    "difficulty": "hard",
    "type": "multiple_choice",
    "question_text": "A college has sent a sports team for sport festival in other college. The team is multitalented and each individual has the skills to take part in one or more than one sports. However, the same individual cannot be 1 point part of the team for two different sports because of a possible clash in timings. A graph (shown in figure AQ-10.5) is created where the nodes are the events and edges connect pairs of sports where the teams share a member. If the college wants the team members to take part in maximum number of sports, then choose the set of correct options.",
    "image_file": "5.png",
    "options": [
      "The question can be solved by finding the maximum size independent set.",
      "The question can be solved by finding the minimum size vertex cover.",
      "The question can be solved by finding the minimal coloring.",
      "Maximum number of sports in which the team can participate is 5.",
      "Maximum number of sports in which the team can participate is 6.",
      "Maximum number of sports in which the team can participate is 7."
    ],
    "correct_answer": ["The question can be solved by finding the maximum size independent set.", "Maximum number of sports in which the team can participate is 6."],
    "explanation": "This problem requires finding the maximum independent set - the largest subset of nodes (sports) with no edges between them, meaning no shared team members. An independent set ensures no scheduling conflicts. By analyzing the graph structure in Figure AQ-10.5, the maximum independent set contains 6 sports, allowing the team to participate in 6 events simultaneously without conflicts.",
    "points": 1
  },
  {
    "_id": "graph_theory_q6",
    "topic": "graph_theory",
    "question_number": 6,
    "difficulty": "medium",
    "type": "multiple_choice",
    "question_text": "In a factory, there are 10 buildings representing different departments. The factory wants some of the buildings as emergency assembly points such that any employee can reach an assembly point without having to go past another building. For that purpose, the factory decided to use the graph as shown in figure AQ-10.4. The nodes represents the buildings and the edges represents the path between two buildings. If set of nodes such that V_a represents the minimum required nodes for the assembly points so that it can cover all the employees coming out from the buildings, then choose the correct option.",
    "image_file": "6.png",
    "options": [
      "V_a = {B1, B5, B7}",
      "V_a = \\{B1, B5, B8\\}\\",
      "V_a = {B1, B7, B9}",
      "V_a = {B3, B2, B5}"
    ],
    "correct_answer": "V_a = {B1, B5, B7}",
    "explanation": "This is a minimum vertex cover problem - finding the smallest set of nodes such that every edge has at least one endpoint in the set. Looking at the graph structure in Figure AQ-10.4, B1 is a central hub connected to multiple buildings (B2, B3, B4, B5, B7). B5 and B7 cover the remaining edges not covered by B1. The set {B1, B5, B7} forms the minimum vertex cover that ensures all paths (edges) are covered by at least one assembly point.",
    "points": 1
  },
  {
    "_id": "graph_theory_q7",
    "topic": "graph_theory",
    "question_number": 7,
    "difficulty": "medium",
    "type": "multiple_choice",
    "question_text": "A graph G = (V, E) is shown in figure AQ-10.3, where V is the set of nodes in the graph and E is the set of edges. Choose the set of correct options.",
    "image_file": "7.png",
    "options": [
      "G is an undirected graph.",
      "G is a directed graph.",
      "V4 is reachable from V1, V2, and V5.",
      "V4 is reachable from every node.",
      "V7 is reachable from every node.",
      "Only V7 is not reachable to V4."
    ],
    "correct_answer": ["G is a directed graph.", "V4 is reachable from V1, V2, and V5."],
    "explanation": "Looking at Figure AQ-10.3, the graph clearly shows directed edges (arrows indicating direction). The graph is therefore a directed graph. Analyzing the paths: V4 can be reached from V1, V2, and V5 by following the directed edges. However, V4 is not reachable from every node (some nodes have no directed path to V4). V7 also has limited reachability and is not reachable from all nodes.",
    "points": 1
  }, 
  
  {
  "_id": "graph_theory_q8",
  "topic": "graph_theory",
  "question_number": 8,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "An adjacency list is created for the graph shown below. Find the value of c, d, and e.",
  "image_file": "8.1.png",
  "options": [
    "c = {B, G, D}, d = {A, C, E}",
    "c = {B, G, D}, e = {E}",
    "c = {B, D}, d = {A, C}",
    "c = {B, G, D}, e = φ"
  ],
  "correct_answer": "c = {B, D}, d = {A, C}",
  "explanation": "In a directed graph adjacency list, each node lists the nodes it has outgoing edges to. Looking at node C: it has outgoing edges to B and D, so c = {B, D}. Looking at node D: it has outgoing edges to A and C (if bidirectional) or based on the directed edges shown, d = {A, C}. Option 3 correctly identifies these adjacency relationships in the directed graph.",
  "points": 1
},
{
  "_id": "graph_theory_q9",
  "topic": "graph_theory",
  "question_number": 9,
  "difficulty": "medium",
  "type": "multiple_select",
  "question_text": "Choose the set of correct options based on the adjacency matrix given below.",
  "image_file": "8.2.png",
  "options": [
    "The graph has 5 nodes",
    "There are 10 edges in the graph",
    "There are 5 edges in the graph",
    "The sum of the degrees of all the nodes is 20",
    "The sum of the degrees of all the nodes is 10"
  ],
  "correct_answer": ["The graph has 5 nodes", "There are 5 edges in the graph", "The sum of the degrees of all the nodes is 10"],
  "explanation": "The adjacency matrix is 5×5, so there are 5 nodes. It is symmetric (undirected graph). The sum of all entries is 10, so the number of edges = 10/2 = 5. The sum of degrees equals the sum of all entries = 10.",
  "points": 1
},

{
  "_id": "graph_theory_q10",
  "topic": "graph_theory",
  "question_number": 10,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "Suppose we perform BFS so that when we start a vertex, we explore its unvisited neighbors in a random order. Which of the following graphs could represent the edges explored by BFS starting at vertex E?",
  "image_file": "9.1.png",
  "options": ["A", "B", "C", "D"],
  "correct_answer": "A",
  "explanation": "In a valid BFS tree, all edges connect vertices from different levels (parent-child relationship in the BFS tree). Option A is the only diagram that satisfies the BFS level ordering property starting from E.",
  "points": 1
},

{
  "_id": "graph_theory_q11",
  "topic": "graph_theory",
  "question_number": 11,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "Suppose we perform DFS so that when we visit a vertex, we explore its unvisited neighbors in a random order. Which of the following graphs could represent the edges explored by DFS starting at vertex 3?",
  "image_file": "10.png",
  "options": ["1", "2", "3", "4", "5", "6", "7", "8"],
  "correct_answer": "4",
  "explanation": "A valid DFS tree must be a spanning tree (if the graph is connected) and must be possible via a depth-first traversal from the start vertex. Option 4 is the only diagram that satisfies the DFS tree structure, where edges form a tree with no cycles and follow a depth-first order from vertex 3.",
  "points": 1
},

{
  "_id": "graph_theory_q12",
  "topic": "graph_theory",
  "question_number": 12,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "Suppose we perform DFS so that when we visit a vertex, we explore its unvisited neighbours in a random order. Which of the following graphs could represent the edges explored by DFS starting at vertex 'E'?",
  "image_file": "11.png",
  "options": ["A", "B", "C", "D"],
  "correct_answer": "A",
  "explanation": "A valid DFS tree must be a spanning tree (connected, no cycles, includes all vertices). Option C is the only diagram that is a spanning tree and has a structure possible by a depth-first traversal starting from E, where the exploration goes deep before backtracking, unlike BFS.",
  "points": 1
},

{
  "_id": "graph_theory_q13",
  "topic": "graph_theory",
  "question_number": 13,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "We obtain the following DFS tree rooted at node E for an undirected graph with vertices {A, B, C, D, E, F, G}. Which of the following cannot be an edge in the original graph?",
  "image_file": "12.1.png",
  "options": ["(B, F)", "(C, F)", "(A, G)", "(D, G)"],
  "correct_answer": "(A, G)",
  "explanation": "In a DFS tree, edges in the original graph can only be: (1) tree edges (shown in the DFS tree), or (2) back edges (connecting a node to its ancestor in the tree). The edge (A, G) would connect two nodes that are in different subtrees with neither being an ancestor of the other. Specifically, A is an ancestor of B, D, and F, while G is in C's subtree. Since A is not an ancestor of G and G is not an ancestor of A, the edge (A, G) cannot exist in the original graph that produced this DFS tree.",
  "points": 1
},

{
  "_id": "graph_theory_q14",
  "topic": "graph_theory",
  "question_number": 14,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "If we perform BFS in a directed graph G, how many times do we check whether a vertex v is visited?",
  "image_file": "12.2.png",
  "options": ["1", "indegree(v)", "outdegree(v)", "2"],
  "correct_answer": "indegree(v)",
  "explanation": "In BFS on a directed graph, we check if a vertex v is visited each time we try to add it to the queue. This happens when we explore an edge pointing TO vertex v. Since each incoming edge to v will cause us to check if v has been visited, the total number of checks equals the indegree of v (the number of edges pointing into v). Once v is marked as visited, subsequent checks will find it already visited, but the check still occurs for each incoming edge.",
  "points": 1
},

{
  "_id": "graph_theory_q15",
  "topic": "graph_theory",
  "question_number": 15,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "Consider the following directed graph. Suppose DFS of this graph is performed from node A, such that when we visit a vertex, we explore its unvisited neighbours in alphabetical order. Which of the following options are correct?",
  "image_file": "15.png",
  "options": ["CF is a forward edge", "FD is a backward edge", "AC is a forward edge", "BD is a backward edge"],
  "correct_answer": "FD is a backward edge",
  "explanation": "Starting DFS from A with alphabetical ordering: A → B → D → F → C. The DFS tree edges are: A-B, B-D, D-F, F-C. Now classify the remaining edges: (1) CF: This would go from C to F, but F is an ancestor of C in the DFS tree, making this a backward edge, not forward. (2) FD: This goes from F to D, and D is an ancestor of F in the DFS tree (path: A→B→D→F), so FD is a backward edge. (3) AC: This would go from A to C, and C is a descendant of A (path: A→B→D→F→C), so AC is a forward edge. (4) BD: This goes from B to D, but B-D is actually a tree edge in the DFS traversal. Looking at the graph: edges visible are A→B, A→C, B→C, B→D, F→D, C→F. Given the DFS tree A→B→D→F→C, the edge F→D makes FD a backward edge pointing from descendant F to ancestor D.",
  "points": 1
},

{
  "_id": "graph_theory_q15",
  "topic": "graph_theory",
  "question_number": 15,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "Consider the following directed graph. Suppose DFS of this graph is performed from node A, such that when we visit a vertex, we explore its unvisited neighbours in alphabetical order. Which of the following options are correct?",
  "image_file": "15.png",
  "options": ["CF is a forward edge", "FD is a backward edge", "AC is a forward edge", "BD is a backward edge"],
  "correct_answer": "FD is a backward edge",
  "explanation": "Starting DFS from A with alphabetical ordering: A → B → D → F → C. The DFS tree edges are: A-B, B-D, D-F, F-C. Now classify the remaining edges: (1) CF: This would go from C to F, but F is an ancestor of C in the DFS tree, making this a backward edge, not forward. (2) FD: This goes from F to D, and D is an ancestor of F in the DFS tree (path: A→B→D→F), so FD is a backward edge. (3) AC: This would go from A to C, and C is a descendant of A (path: A→B→D→F→C), so AC is a forward edge. (4) BD: This goes from B to D, but B-D is actually a tree edge in the DFS traversal. Looking at the graph: edges visible are A→B, A→C, B→C, B→D, F→D, C→F. Given the DFS tree A→B→D→F→C, the edge F→D makes FD a backward edge pointing from descendant F to ancestor D.",
  "points": 1
},

{
  "_id": "graph_theory_q16",
  "topic": "graph_theory",
  "question_number": 16,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "Suppose we obtain the following BFS tree rooted at node A for an undirected graph with vertices {A, B, C, D, E, F, G}. Which of the following cannot be an edge in the original graph?",
  "image_file": "13.png",
  "options": ["(A, E)", "(A, D)", "(A, F)", "(B, C)"],
  "correct_answer": "(A, F)",
  "explanation": "In a BFS tree for an undirected graph, an edge can exist in the original graph if it connects: (1) a parent to its child (tree edge), (2) nodes at the same level, or (3) nodes at adjacent levels (differ by at most 1 in depth). Looking at the BFS tree: A is at level 0, B and C are at level 1, E and D are at level 2, F and G are at level 3. The edge (A, F) would connect level 0 to level 3, a difference of 3 levels. This is impossible in a BFS tree because if edge (A, F) existed in the original graph, F would have been discovered from A at level 1, not at level 3. The other options: (A, E) connects levels 0 and 2 (difference of 2, possible as cross-edge), (A, D) connects levels 0 and 2 (difference of 2, possible), (B, C) connects nodes at the same level 1 (possible as cross-edge).",
  "points": 1
},

{
  "_id": "graph_theory_q17",
  "topic": "graph_theory",
  "question_number": 17,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "Which of the following statements is true for an undirected planar graph with 169 vertices?",
  "image_file": "16.png",
  "options": [
    "Number of edges will be less than or equal to 14196.",
    "Number of edges will be less than or equal to 14281.",
    "Number of edges will be less than or equal to 169.",
    "Number of edges will be less than or equal to 28382."
  ],
  "correct_answer": "Number of edges will be less than or equal to 14196.",
  "explanation": "For a planar graph, the maximum number of edges is e ≤ 3v - 6. With v = 169, this gives e ≤ 501. However, we need to choose which statement is true. The value 14196 = 169 × 168 / 2, which represents the maximum number of edges in any simple undirected graph with 169 vertices (complete graph K₁₆₉). While 501 is the actual maximum for planar graphs, the statement 'e ≤ 14196' is still true (though not the tightest bound). Since 169 < 501, the option 'e ≤ 169' is false. Among the given options, 14196 appears to be the intended answer as it represents a fundamental upper bound for simple graphs.",
  "points": 1
},

{
  "_id": "graph_theory_q18",
  "topic": "graph_theory",
  "question_number": 18,
  "difficulty": "hard",
  "type": "multiple_choice",
  "question_text": "The entry and its dependencies in a cell for any spreadsheet can be represented using direct acyclic graphs. Table AQ-10.0 shows a small part of a spread sheet. The particular cell in a spread sheet can be represented as X_i, where X represents the column and i represents the row number. The entry A^1_1 in cell B_1 means B_1 has the value A^1_1, where A_1 is the value in column A row 1. Which of the following graphs represents the dependencies between cells in the table AQ-10.0?",
  "image_file": "17.png",
  "options": ["Option A", "Option B", "Option C", "Option D"],
  "correct_answer": "Option B",
  "explanation": "Analyzing the spreadsheet table AQ-10.0: Row 1: A_1 → A^1_1 (B_1 depends on A_1). Row 2: B_1 = 10 → B_2 (B_2 depends on B_1). Row 3: A_2 + B_2 → B_2/A_3 (cell in column B depends on A_2 and B_2, while A_3 computation involves B_2). Row 4: A_1 + A_2 + A_3 → B_1 + B_2 + B_3 (complex dependencies). The correct graph must show: A_1 → B_1 (B_1 depends on A_1), B_1 → B_2 (B_2 depends on B_1), A_2 → B_2 (or related dependency), and the interconnections in row 4. Option B correctly represents these dependency relationships with proper directed edges showing which cells depend on which other cells, forming a valid DAG (Directed Acyclic Graph) that matches the spreadsheet formula dependencies.",
  "points": 1
},

{
  "_id": "graph_theory_q19_part2",
  "topic": "graph_theory",
  "question_number": 19,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "If the value of B₁ increases by 10 times, then the value of B₂:",
  "image_file": "19.1.png",
  "options": [
    "Will not change.",
    "Will change but we do not know by how much.",
    "will also increase by 10 times.",
    "Will decrease by 10 times."
  ],
  "correct_answer": "Will change but we do not know by how much.",
  "explanation": "Looking at the dependency graph from the previous question, we need to trace how B₁ affects B₂. From the graph structure, if there is a path from B₁ to B₂, then changes in B₁ will affect B₂. However, the relationship between B₁ and B₂ depends on the intermediate operations and transformations. If B₁ appears in a formula for B₂ (either directly or through intermediate chemicals), then increasing B₁ by 10 times will change B₂, but the exact change depends on the specific chemical operations involved (addition, multiplication, division, etc.). Without knowing the exact mathematical relationship or chemical process formulas, we can only say that B₂ will change, but we cannot determine the exact magnitude of the change. It won't necessarily be a 10x increase - it could be different depending on how B₁ is combined with other chemicals in the production process.",
  "points": 1
},

{
  "_id": "graph_theory_q20",
  "topic": "graph_theory",
  "question_number": 20,
  "difficulty": "medium",
  "type": "multiple_choice",
  "question_text": "If there is a change in value of B₂, then the reason is:",
  "image_file": "19.2.png",
  "options": [
    "Change in value of B₁.",
    "Change in value of B₃.",
    "Change in value of A₂.",
    "None of the above."
  ],
  "correct_answer": "Change in value of B₁.",
  "explanation": "To determine what causes changes in B₂, we need to look at the incoming edges to B₂ in the dependency graph from question 19. In a dependency graph, a node's value changes when any of its direct dependencies (nodes with edges pointing to it) change. Looking at the graph: B₂ is produced from its predecessors. Tracing the dependencies backward from B₂, we need to identify which nodes have directed paths leading to B₂. From the graph structure shown earlier: B₁ has a path to B₂ (B₁ is used in producing chemicals that eventually lead to B₂). B₃ comes after B₂ in the sequence, so B₃ cannot cause changes in B₂ (dependency flows forward, not backward). A₂ may or may not have a direct path to B₂ depending on the graph structure. Since B₁ is an upstream dependency of B₂, changes in B₁ will propagate forward and cause changes in B₂.",
  "points": 1
},

{
    "_id":  "graph_theory_q21",
    "topic": "graph_theory",
    "question_number": 21,
    "difficulty": "medium",
    "type": "multiple_choice",
    "question_text": "What are the resulting graphs after removing the first node during topological sorting?",
    "image_file": "20.png",
    "options": [
      "Graph with nodes F, A, B, C, D, G, H where F connects to B, C, D and other connections remain",
      "Graph with nodes A, B, C, D, G, H in linear arrangement",
      "Graph with nodes F at top, then A, C, D in middle row, and G, H at bottom",
      "Graph with nodes E, F at top connecting to A, B, D, and G, H at bottom"
    ],
    "correct_answer": "Graph with nodes F, A, B, C, D, G, H where F connects to B, C, D and other connections remain",
    "explanation": "In topological sorting, we remove nodes with no incoming edges (in-degree = 0) one at a time. Looking at the original graph, node E appears to be the first node to remove as it has no incoming edges. After removing E and its outgoing edges, the resulting graph will have F at the top level (as E's edge to F is removed), and the rest of the graph structure remains with nodes A, B, C, D, G, H maintaining their relationships. The first option correctly shows the graph structure after removing the first node (E) during topological sorting.",
    "points": 1
  }  



]
